In [ ]:
# write code to Generate below looking list
# [[1],[2,3],[4,5,6],[7,8,9,10],[11,12,13,14,15,16]......]

In [ ]:
# %pip install psycopg2

In [1]:
import psycopg2

# dbapi
# sqlalchemy

In [2]:
connection = psycopg2.connect(database="postgres",
                        host="localhost",
                        user="postgres",
                        password="postgres",
                        port="5432")

In [3]:
cursor1 = connection.cursor()

In [9]:
cursor1.execute("SELECT * FROM staff")


cursor1.execute('''SELECT * FROM staff
                where salary > 5000
                ''')

In [14]:
print(cursor1.fetchone())

None

In [5]:
import pandas

In [7]:
data = pandas.DataFrame(cursor1.fetchall(),columns=[])

In [8]:
data

,0,1,2,3,4,5,6,7,8,9,10
0,1,Kipling,Smith,M,1970-03-03,"789 Oak Street, Anytown, CA 91234",789-012-3456,kip@email.com,Professor,Computer Science,5000
1,2,Ram,Prasath,M,1971-04-04,"567 Pine Street, Anytown, CA 91234",567-890-1234,ram@email.com,Chair,Mathematics,6000
2,3,Thi,Smith,M,1970-03-03,"789 Oak Street, Anytown, CA 91234",789-012-3456,kip@email.com,Professor,Computer Science,4500
3,4,Deepiga,Smith,M,1970-03-03,"789 Oak Street, Anytown, CA 91234",789-012-3456,kip@email.com,Professor,Computer Science,6500
4,5,Arun,Smith,M,1970-03-03,"789 Oak Street, Anytown, CA 91234",789-012-3456,kip@email.com,Professor,Zoology,7500
5,6,Arun,Pandian,M,2023-09-03,"789 Oak Street, Anytown, CA 91234",789-012-3456,kip@email.com,Professor,Physics,7000

In [51]:
for row in data:
    print(row)

(1, 'Kipling', 'Smith', 'M', datetime.date(1970, 3, 3), '789 Oak Street, Anytown, CA 91234', '789-012-3456', 'kip@email.com', 'Professor', 'Computer Science', 5000)
(2, 'Ram', 'Prasath', 'M', datetime.date(1971, 4, 4), '567 Pine Street, Anytown, CA 91234', '567-890-1234', 'ram@email.com', 'Chair', 'Mathematics', 6000)
(3, 'Thi', 'Smith', 'M', datetime.date(1970, 3, 3), '789 Oak Street, Anytown, CA 91234', '789-012-3456', 'kip@email.com', 'Professor', 'Computer Science', 4500)
(4, 'Deepiga', 'Smith', 'M', datetime.date(1970, 3, 3), '789 Oak Street, Anytown, CA 91234', '789-012-3456', 'kip@email.com', 'Professor', 'Computer Science', 6500)
(5, 'Arun', 'Smith', 'M', datetime.date(1970, 3, 3), '789 Oak Street, Anytown, CA 91234', '789-012-3456', 'kip@email.com', 'Professor', 'Zoology', 7500)
(6, 'Arun', 'Pandian', 'M', datetime.date(2023, 9, 3), '789 Oak Street, Anytown, CA 91234', '789-012-3456', 'kip@email.com', 'Professor', 'Physics', 7000)

In [21]:
connection.close()

In [ ]:
def get_connection():
	try:
		return psycopg2.connect(
			database="postgres",
			user="postgres",
			password="postgres",
			host="localhost",
			port=5432,
		)
	except:
		return False

conn = get_connection()

if conn:
	print("Connection to the PostgreSQL established successfully.")
else:
	print("Connection to the PostgreSQL encountered and error.")